app/views/cocktails/show.html.erb

SELECT "doses".* FROM "doses" WHERE "doses"."cocktail_id" = $1  [["cocktail_id", 1]]
---
  <div class="ingredients">
    <% @cocktail.doses.each do |dose| %>