app/controllers/doses_controller.rb

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @dose = Dose.new
    @cocktail = Cocktail.find(params[:cocktail_id])

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "doses" ("description", "cocktail_id", "ingredient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Half a shot"], ["cocktail_id", 1], ["ingredient_id", 4], ["created_at", "2018-08-16 14:38:37.110762"], ["updated_at", "2018-08-16 14:38:37.110762"]]
---
  def create
    @dose = Dose.new(dose_params)
    @cocktail = Cocktail.find(params[:cocktail_id])
    @dose.cocktail = @cocktail
    @dose.save

SELECT  "doses".* FROM "doses" WHERE "doses"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "doses" WHERE "doses"."id" = $1  [["id", 4]]
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @dose = Dose.find(params[:id])
    @dose.destroy
    cocktail = Cocktail.find(@dose.cocktail_id)